No columns are joined to grid lines, or view parameters exclude all columns.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoColumnsJoinedToGridLines { get; }
  Visual Basic
Public Shared ReadOnly Property NoColumnsJoinedToGridLines As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoColumnsJoinedToGridLines {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ScheduleViewFailures Class
  Autodesk.Revit.DB Namespace